tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "sass/sass"

cask_args appdir: "/Applications"

brew "xz"
brew "asdf"
brew "fish"
brew "gh"
brew "git"
brew "imagemagick"
brew "libpq"
brew "z"
brew "mas"
brew "sass/sass/sass"

cask "google-chrome"
cask "slack"
cask "discord"
cask "1password"
cask "google-japanese-ime"
cask "the-unarchiver"
cask "bartender"
cask "zoom"
cask "hammerspoon"
cask "notion"
cask "notion-calendar"
cask "sequel-ace"
cask "adobe-creative-cloud"
cask "clipy"
cask "deepl"
cask "docker"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "postman"
cask "github"
cask "termius"
cask "font-hack-nerd-font"
cask "google-drive"
cask "gitkraken"

mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "LadioCast", id: 411213048
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "RunCat", id: 1429033973
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "WireGuard", id: 1451685025
