tap "homebrew/bundle"
tap "homebrew/cask-fonts"

cask_args appdir: "/Applications"

brew "xz"
brew "asdf"
brew "fish"
brew "gh"
brew "git"
brew "imagemagick"
brew "libpq"
brew "z"
brew "mas"

cask "google-chrome"
cask "slack"
cask "discord"
cask "1password"
cask "google-japanese-ime"
cask "the-unarchiver"
cask "bartender"
cask "zoom"
cask "hammerspoon"
cask "notion"
cask "notion-calendar"
cask "sequel-ace"
cask "adobe-creative-cloud"
cask "clipy"
cask "deepl"
cask "docker"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "postman"
cask "github"
cask "termius"

cask "blackhole-16ch"
cask "blackhole-2ch"
cask "blackhole-64ch"
cask "font-hack-nerd-font"
