tap "homebrew/bundle"
tap "oven-sh/bun"

cask_args appdir: "/Applications"

brew "asdf"
brew "fish"
brew "gh"
brew "git"
brew "libpq"
brew "libyaml"
brew "mas"
brew "nkf"
brew "xz"
brew "pipx"
brew "yarn"
brew "z"
brew "oven-sh/bun/bun"
cask "1password"
cask "adobe-creative-cloud"
cask "arc"
cask "atok"
cask "bartender"
cask "clipy"
cask "cursor"
cask "deepl"
cask "discord"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "github"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "notion"
cask "notion-calendar"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "termius"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "zoom"

mas "RunCat", id: 1429033973
mas "Windows App", id: 1295203466
mas "Spark", id: 1176895641
mas "Tailscale", id: 1475387142
mas "Magnet", id: 441258766
